---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternFlip
source: html/310fee5f-4769-2bb9-6fa3-1fa7b32efa51.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternFlip Property

"Component Flip"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfacePatternFlip { get; }
```